{
  "number": 113,
  "name_devanagari": "भावनागम्या",
  "name_transliterated": "Bhāvanāgamyā",
  "meaning": "She can be reached easily only through right bhāvana.",
  "commentary": "(Bhāvana is a combination of intense deep feelings, mental perceptions and imagination. This feeling has an emotional quality to it. Healthy bhāvanās pave the way for connecting with the Supreme).\n\nShe who is incomprehensible and far beyond reach can be reached purely through proper, deep intense feelings (bhāvanās) of love, care and devotion.\n\nA mind devoid of such feelings and which uses pure logic cannot take the person towards the goal. When there are no feelings of devotion, even if God were to come and stand directly in front, the mind would refuse to believe.\n\nSuch feelings of love and devotion can be developed towards Her physical manifestation (roopa bhāvana), towards Her as a form of supreme energy (shakti bhāvana), towards Her as a form of Brahma, as a yogic power residing within us or in any other way that is appealing to the mind. All of these paths lead towards Her. Most important pre-requisite is to give up ahamkara (ego) because ego and bhāvana cannot co-exist.\n\nBhāvana gives a form (within the mind) to the formless Lord; gives an ability to visualize the otherwise unfathomable energy. It converts the unmanifest (avyakta) into manifest (vyakta).\n\nThe fruits, flowers, water and every other offering inherently belong to that Lord. We offer, what belongs to Him, back to Him. We add merely our feelings of love and devotion (bhāvana) to it.  In the naivedya (offering of food during puja), the Lord takes only our bhāvana (feelings of love and devotion) and leaves the food for us as a prasad. External worship, decorations and arrangements are only aids to strengthen the bhāvanas but are not an end in themselves.\n\nBhāvana differs from Kalpana. In Kalpana there is a component of imagination that is useful as in art, design, science etc. Yet it lacks the deep emotional feelings that exist in bhāvana."
}