{
  "number": 181,
  "name_devanagari": "मृत्युमथनी",
  "name_transliterated": "Mṛtyu-mathanī",
  "meaning": "O Lord! You are sweet smelling (sugandhi) and bestow good health. Further very easily You dispel the fear of death. Please free me from this fear of death but not from the experience of Amrita (nectar, bliss).",
  "commentary": "Many a time this name is interpreted to mean that the Supreme Mother relieves the devotee from the misery called death. If so, then devotees should be living eternally on this earth across eons? However we do not see this happening. Therefore we should delve into the inherent deeper meaning that is contained within this name.\n\nEvery being right from an infant has a sub-conscious fear of death. Such fear has its origin in our samskaras (past impressions, tendencies). There are many who spend sleepless night out of fear that they could die in their sleep.\n\nFor washing away this fear of death from her children, the Divine Mother is मृत्यु-मथनी। (Mṛtyu-mathanī.) Living without the fear of death is an immense boon.\n\nThe sacred text ‘Bhagavatam’ stemmed out of this fear of death. Emperor Parikshit, who was cursed to die within 7 days, developed immense fear of death. To alleviate his fears, Suka Maharishi preached him the entire Bhagavatam.\n\nUpon listening to this, Parikshit lost his fear and welcomed death. Overcoming this fear is no ordinary achievement.\n\nWithin the Mahabharata there are 3 extremely important portions- the Sanat Sujātīyam, the Bhagavad Gita and the Vishnu Sahasranāma. Amongst them, the Sanat sujātīyam contains elaborate discussion about mrutyu (death). It declares that death is nothing but smriti rāhityam (loss of memory) and pramadam, where the inner being forgets the body that it had taken so far.\n\nTo alleviate this fear of death, Mrutynjaya swamy is also worshipped through the mantra –\n\nAum tryambakam yajāmahe सुगन्धिं (sugandhiṃ) पुश्टि-वर्धनं (puśṭi-vardhanaṃ) |Urva rukamiva bandhanan मृत्योर् (mṛtyor) – mukshīya māmrutat |"
}