{
  "number": 190,
  "name_devanagari": "दुर्गा",
  "name_transliterated": "Durgā",
  "meaning": "All of us are reflections of Her form. She is the mirror within which we are seeing ourselves and thus this world exists. She has turned Herself into this universe. She is the cause for this creation. In this creation that is full of form and name, She has taken on a form. The entire visible nature (Prakriti) is Her form and so She ensures a never-ending abundant supply of all materials and sources in it. The five basic elements (pancha bhootas) are also Her forms. She is the endless energy that renews itself every day or every second. She is endless, forever young and vibrant and ever-powerful. She is Nava Durga (the 9 forms of Durga).",
  "commentary": "This is one of the prominent names of Divine Mother.\n\n1) She cannot be reached by those who are eternally drowned in sorrow and grief.\n\nAny worship or penance done to reach Her when the mind is sorrowful is unproductive. This is because the mind and the intellect (buddhi) will be focused on the sorrowful thoughts and will cease to contemplate upon Her during worship.\n\nThe 3 names Durlabha, Durgama and Durga teach us that mental efforts are extremely crucial if one is truly desirous of reaching Her. In effect, all 3 names have the same meaning.\n\n2)  Durga also suggests that She destroys all problems, impediments and grief of those who worship Her with full faith and dedication.\n\nIn this hymn in Chandi (or Durga) Saptashati, the Divine Mother is praised as –\n\nDurge smrta harasi bhitimaśeśa जन्तोःस्wअस्थैह् (jantoḥSwasthaih) smrtamati matīva shubhām dadāsiDāridra duhkha bhayahārini का (kā) twadanyaSarvopakarkaranaya sadādrachittā\n\nMeaning: O Mother! Even the worst problematic impediments and situations will simply vanish if the person just once calls out your name ‘Durga’. Such is the protection that you offer, not just to humans, but to all forms of beings. You dispel fear and instill confidence. You bestow good intellect and knowledge on to those who are truly aspiring for it. There is no power greater than You which can drive away poverty (dāridra) and grief (dukha). All this is possible because your heart is replete with love, compassion (daya).\n\nThis is the power of Her name. This is the true meaning of the name Durga.\n\nPraying to Durga at the time of commencement of a journey is a common practice in most places. That She will take care of all the impediments along the way and ensure a peaceful and safe journey is the faith behind this practice. Such a practice should not be limited to merely train and air travels. Life is a journey. In this journey, we should pray to Her to clear all obstacles in the path and to safely take us to our destination.\n\nDurga Devi split herself into 9 forms for the destruction of demons. These forms are known as Nava Durga.\n\nYasyām bimbita ātmatattvamagamāt sarveśwarākhyām śubhāmYā viśwat jagadātmanā परिणता (pariṇatā) या (yā) nāma rūpāshrayāYā mūla prakrtir गुनत्रयवती (gunatrayavatī) या (yā) nanata śaktih swayamNitā vrutta navātmika jayatu sad Durgā nava kārinī\n\nThe following is a 9th verse Adi Shankaracharya’s composition – Dakshinamurty stotram\n\nभूर्-अम्बाम्सि-अनलो-निलो-(अ)म्बरम् अहर्नाथो हिमाम्शु: पुमानिति-आभाति चरा-चर-आत्मकम्-इदम् यस्यैव मूर्ति-अस्ह्टकम् (bhūr-ambāmsi-analo-nilo-(a)mbaram aharnātho himāmśu: pumāniti-ābhāti carā-cara-ātmakam-idam yasyaiva mūrti-ashṭakam)\n\nThis hymn states that the Lord splits himself into 8 forms and is known as Ashtamurti. Even Lalita Sahasranama describes the Divine Mother as Asthamurti. These 8 forms together with her Atma swaroopa (form of the self) total nine. Then She is known as Nava Durga."
}