{
  "number": 200,
  "name_devanagari": "सर्वमङ्गला",
  "name_transliterated": "Sarva-maṇgaḷā",
  "meaning": "Just by thinking about Brahma all forms of evils and inauspiciousness (ashubha) are driven away and auspiciousness (shubha) is bestowed upon the person.",
  "commentary": "सर्व-मण्गऌअ (Sarva-maṇgaḷa) is one name. Hence while reciting one should not pause after the word Sarva. Instead, it should be – सर्वशक्ति-मयी (Sarvaśakti-mayī) (pause) Sarva-maṅgaḷā.\n\nThe sacred text ‘Chandi Saptashati’ praises the Divine Mother as –\n\nसर्व मण्गऌअ मान्गऌये शिवे सर्वार्थ साधिकेशरन्ये त्रयम्बक्ē देवि नारायणि नमोस्तुते (Sarva maṇgaḷa māngaḷye śive sarvārtha sādhikeŚaranye trayambakē devi nārāyaṇi namostute)\n\nReference to the Divine Mother with this name also appears in the hymn ‘Lalita Trishati’. सर्व-मण्गऌआ (Sarva-maṇgaḷā) is also one of the names of Lord Brahma. The following hymns explain the ever-auspicious nature of Lord Brahma.\n\nअतिकल्यानरुपत्वात् नित्यकल्यानसम्श्रयात् ǀस्मर्त्रुनम् वरदत्वछ ब्रह्म तन्मन्गऌअम् विदुः ǁ (Atikalyānarupatvāt nityakalyānasamśrayāt ǀSmartrunam varadatvacha brahma tanmangaḷam viduḥ ǁ)\n\nAśubhāni nirācaśte tanoti शुभसन्ततिं (śubhasantatiṃ) ।स्मृति-मात्रेण (|smṛti-mātreṇa) yat pumsām brahma tanmangaḷam विदुः (viduḥ) ǁ\n\nBrahma is Sarva mangala (ever auspicious).\n\nWith this, 200 names are complete. Having crossed the second compound (avarana) we are now stepping into the third enclosure (avarana). In this enclosure, The Divine Mother assumes the name ‘Sarva Samkhshobini’. The enclosure itself goes by the name ‘Sarva samkshobhini chakra’.\n\nThe first enclosure was the ‘Trailokya mohana chakra’ where the un-manifest becomes manifest. The triad (triputi) comes into existence at this step. The second enclosure is the Sarvāśā paripūraka chakra. The term ‘Sarvāśa paripūra’ means fulfillment of every desire. The Divine Mother fulfills the desires of her children.\n\nIsn’t it the duty of the mother to take the child who, although his desires are fulfilled still encircles at that spot, to the next level? Here comes the third enclosure – the Sarva Samkshobhini chakra. The attractions of the mind that cause emotional disturbances (kshobha) are driven away and the individual is led a step ahead."
}