{
  "number": 204,
  "name_devanagari": "सर्वमन्त्रस्वरूपिणी",
  "name_transliterated": "Sarva-mantra-svarūpiṇī",
  "meaning": "Shiva sounded the dhakka (drum) 45 times in the assembly of eminent Maharishis. Based on individual capacity a different shastra (scripture) or stotra (hymn, incantation) resounded in the ear of each Maharishi seated there. They accepted the shastra received by them as divine order and accordingly developed that shastra (scripture). The first sound that was heard by them was Omkāra (Pranava mantra, OM).",
  "commentary": "It has the same meaning as ‘Mūla mantrātmika mūla kūtatraya kalebara’\n\nA mantra is composed of various alphabets (akśaras). Such alphabets have originated from sound (nāda). She manifests both as alphabets (akśara) and as sound (nāda) of the mantra. ‘Mantra’ includes the Veda mantras and Omkaara (ॐ)। ((Om).)\n\nMantras total 7 crores in number. The word ‘Mantra’ inherently means ‘thought’ (alochana). The word Mantri (minister) originates from this and represents one who thinks, reflects deeply and acts. Mantra recitation (japa) amounts to thinking, reflecting and contemplating about the Almighty. The mind is filled with thoughts and feelings about the Lord. Mantra purifies; it is the cause of the creation of good thoughts (sadālochana) within us.\n\nRepetition of the mantra has a tremendous effect on our body and mind. Mantras are of various types and energies. Mantras consist of Sanskrit syllables because Sanskrit is the language of Gods.The entire creation began with a loud sound (akin to big bang theory). That sound was Omkāra!\n\nन्र्त्तवसाने नटराज-राजो ननाद धक्कम् नवपन्चवारमुद्धर्तुकामह् सनकादिसिद्धा नेतद्विमर्शे शिवसूत्रजालम् (Nrttavasāne Naṭarāja-rājo nanāda dhakkam navapancavāramUddhartukāmah sanakādisiddhā netadvimarśe śivasūtrajālam)\n\nBrahma is the ādi kavi (the first poet). For having created this wonderful universe, He is accredited with the title ādi kavi. At the initial stage when Brahma was clueless about creation and its procedure, Vishnu came to his rescue and preached him at first the Omkāra followed by the Vedas. Then with this renewed clarity Brahma could begin his task of creation. Innumerable mantras have originated from this Omkāra.\n\nSome time ago, the Japanese scientists decided to investigate the connection that exists between water and mantras. A few people were given plates containing water. Each person was asked to recite a different syllable with the water plate in front of him. This investigation went on for many days. Sitting at a distance, the scientists were observing the on-goings. After about 4 days, the water molecules underwent a change and the images of the deities, who were being invoked, were visible in the plates of water. These images were captured on their camera.(These details are available in the internet)."
}