{
  "number": 224,
  "name_devanagari": "महासिद्धिः",
  "name_transliterated": "Mahā-siddhih",
  "meaning": "She is the storehouse of the greatest or the most-supreme siddhis (accomplishments).",
  "commentary": "What is that most supreme accomplishment that She possesses?\n\nA common man presumes that acquiring the ability to fly in air, stand in fire, to be present simultaneously at multiple places and the like are siddhis (accomplishments). Such accomplishments are not the end in itself. Great mahatmas display such accomplishments purely to attract the ordinary onto the divine path and to create in them a desire to progress spiritually.\n\nSiddhi (accomplishment) is that which causes a calm state of sthitapragna (where the consciousness/ mind is free from even the remotest agitation) and hence is immobile and steady. This is the greatest accomplishment (Mahā-siddhi) sought by a yogi.\n\nDuring the Anagha vrata puja conducted on ashtami day, the ‘ashta siddhis’ (8 supernatural accomplishments) are invoked and worshipped together with Anagha Swami and Anagha Devi. What does it symbolize?\n\nIn this vrata, Parabrahma, as Anagha Swami seats himself in the centre of the lotus together with his energy (Maha shakti) depicted as His spouse, Anagha Devi. The 8 super natural powers (ashta siddhis) position themselves around them as their children.\n\n‘Anagha’ is the energy that destroys sins. This name depicts that He is over and above any form of sin. Worshipping them blesses the devotee with the 8 super natural accomplishments (ashta siddhi). Asthami, the 8th day of the lunar calendar, is that day which creates the eight fold nature (ashta aatma guna) in us. Let us understand about these eight supernatural powers (ashta siddhis) briefly –\n\nAnima, mahima chaiva garima laghima tathaPraaptih praakāmya īshatvam vasitvam chāstha siddhayah\n\nअ) अनिम –रसानाम् स्wअत उल्लसह प्रथमा सिद्धि रेएरित (a) Anima –Rasānām swata ullasaha prathamā siddhi reerita)\n\nInherently each being possesses several tastes (rasas) that delight and attract the mind. For instance the mouth waters when a favourite dish is placed in front of the eyes. Controlling the mind (niyantrana) and preventing it from running behind the attractions and tastes is the first siddhi (accomplishment). No further progress can be achieved unless and until this is accomplished.\n\nब्) महिम –द्वन्द्वै रनभि भोओतिस्छ्या द्वितेएय सिद्धि रेएरित (b) Mahima –Dvandvai ranabhi bhootischyā dviteeya siddhi reerita)\n\nDvanda is the concept of dualism. Rising over and above this state of dualism and being without conflicts is itself the second accomplishment.\n\nच्) गरिम –अधमोतमत भवह त्रुतेएय सिद्धि रुत्तमा (c) Garima –Adhamotamata bhavaha truteeya siddhi ruttamā)\n\nRising above the state of seeing differences within people; no longer defining or classifying people as good and bad (uttama and adhama), great or small, is in itself the third accomplishment.\n\nद्) लघिम –छतुर्थि तुल्यता तेस्हाम् अयुस्ह सुख दुख योह् (d) Laghima –Chaturthi tulyatā teshām ayusha sukha dukha yoh)\n\nThe fourth accomplishment is an extension of the third. Achieving a state of treating everyone alike, seeing the Lord seated in every heart and therefore having a balanced outlook towards all beings is the fourth accomplishment. This is the fourth supernatural power. At this stage, the person also has to mentally be in a state that is above joys and sorrows (sukha- dukha).\n\nए) प्राप्ति –कन्तेर्बलस्य बाहुल्यम् विस्होका नाम पन्छमि (e) Prāpti –Kanterbalasya bāhulyam vishokā nāma panchami)\n\nThe mental strength (mano balam) is achieved.  Only at this point the inner lamp is lit.\n\nफ़्) प्राकाम्यम् –परमात्म परत्वेन तपो ध्यानादि निस्ह्थिता (f) Prākāmyam –Paramātma paratvena tapo dhyānādi nishthitā)\n\nThis is the next stage of accomplishment. Full and firm belief that everything in this universe is a form of that God; it is His energy within us that is the cause of all actions should exist. With such belief, the person should be able to practice endless dhyana (contemplation).\n\ng) Eeśitvam-Nishkāma chāritvam saptami siddhi ruchyate\n\nThe seventh accomplishment lies in performing nishkāma karma – actions without entertaining even the remotest desire. Even meditation (dhyana) should be without any expectations (nishkāma).\n\nह्) वस्हिश्त्वम् – कामावसायितअस्ह्तमि छ तथा प्रोक्ता यत्र क्वछन स्हयिते (h) Vashiśtvam – kāmāvasāyitaAshtami cha tathā proktā yatra kvachana shayite)\n\nThis last accomplishment is Kāmāvasāyita – it means putting an end to desires of any kind. The mind should be able to adapt to any kind of surroundings without any feelings of like or dislike. This state of sthitaprajna is the Mahā – siddhi."
}