{
  "number": 233,
  "name_devanagari": "महाकामेशमहिषी",
  "name_transliterated": "Mahā-kāmeśa-mahiṣī",
  "meaning": "She is the queen (mahishi) of Maha-kameśa i.e. Parabrahma.",
  "commentary": "The names Kameśwara and Kameśa refer to Parabrahma. After the great deluge (explained above), when even Brahma ceases to exist, only Parabrahma remains. His divine energy is being addressed as His queen.\n\nParabrahma, immersed in His state of uninterrupted divine bliss (Ananda) remains motionless (sthānu). The energy (Divine Mother) winds Herself like a creeper (लता) ((latā)) around Parabrahma who is thus sitting motionless (sthanu). Her energy stimulates Him towards action. It results in a fresh creation.\n\nThis process is visible in the Mallikarjuna temple at Srisailam (Andhra Pradesh). The (Old) Vruddha Mallikarjuna Swamy lingam, that is worshipped as Shiva and which appears as a rock is actually the fossil of a tree trunk. Bloodstains are clearly visible on it. When Parabrahma was seated motionless, His energy wound itself around Him like a jasmine creeper. With this, the dried up trunk began to sprout and this once again led to creation. When the tree had fully grown with all its branches, it was mercilessly cut off. It thus repeated 5 times; each time the tree was mercilessly chopped. Finally the creeper decided to stay away from the tree.\n\nThis is visible even within the human body. A person who is drained of all energy lies motionless. When food is supplied, the shakti (energy) returns and winds itself around the motionless body. This causes stimulation to the body and it begins to move.\n\nIn the human body such stimulation should be provided to the blood cells. Pranayama causes such stimulation to them. Pranayama should be undertaken until the body heats up and sweats profoundly. This process of deep breathing revives the healthy cells and kills the sickly poisonous cells in our body. Poisonous cells thrive with short breath.\n\nThis process of Pranayama and the stimulation that it causes has been explained through the story of the creeper. Deep breathing through the process of Pranayama leads to the stimulation of the nādis (the subtle astral nerves, referred to as a creeper). The primary nādis are the Ida, Pingala and Sushumna. Through Pranayama, when life is infused into these naadis, a new consciousness (chaitanya) begins within us. Until this is done, we are deprived of this chaitanya.\n\nObserve the sequence in the progression of the names. After the great deluge (maha pralaya), the Supreme Shiva performed the dance of bliss (maha tandava) to which she (shakti, energy) was the sole witness. Now He was in supreme bliss. To trigger a new creation, the divine energy caused stimulation in Him. The next name explains the state that emerges after the infusion of stimulation, i.e. the first step in creation is detailed. The first step in creation is always the triad (set of three, Triputi).\n\nLet us try to relate this process at the individual level. Through performing the inner worship (Mahā- yāga-kramārādhyā, explained in the above names) the individual goes into a state of meditation and merges into the infinite. This is the Maha Pralaya (great deluge, total merger). At this point the Maha tandava, or the dance of supreme bliss, takes place. In such a person, who is sitting motionless like a rock, enjoying his bliss, she (energy) causes stimulation. He awakens from that deep meditation and begins his descent into the material world. The first point in creation is the triputi (triad). With this, the individual now comes back into the material world."
}