{
  "number": 249,
  "name_devanagari": "पञ्चप्रेतासनासीना",
  "name_transliterated": "Pañca-pretāsanāsīnā",
  "meaning": "She retains the pancha (five) pretās as Her Seat (asana).",
  "commentary": "The 5 pretas (pancha pretas) are Brahma, Vishnu, Eshwara, Rudra and Sadāshiva.Preta can be split as pra+ itah, which means ‘he who is deceased; he who has reached the abode of the Lord’. When the life force (chaitanya) departs from the body it becomes a corpse (jadaa, kalebara).\n\nAs explained in the nama 232 ‘Maha tāndava sākśini’, at the end of creation, the Supreme Parabrahma absorbs everyone, including the Trinity into Himself. He then conducts the cosmic dance. The Chidambara Rahasyam (secret) at the Chidambaram temple highlights the state of total merger when nothing exists. As the Gods do not have any existence they are being referred to as ‘pretas’ (literally meaning lifeless). The Divine Mother now retains these deities as Her seat. This indicates clearly that She is Parabrahma. After some time, She resumes creation wherein they are brought back into existence.\n\nLet us understand a little in detail about these pancha pretas. Parabrahma got the sankalpa (intent) to visualize Himself in innumerable forms. This led to creation.\n\nFrom Him emerged Brahma, Vishnu and Shiva, Eshwara and Sadashiva. These are the 5 main deities (Devatas) who took on the 5 main tasks associated with the creation, sustenance, dissolution, tirodhāna and anugraha (showering grace or blessings; final merger). These five tasks are known as Pancha krtya.\n\nThere are 3 levels of existence – Parabrahma level, Devata level and Manushya (human) level. Parabrahma is the ultimate level. Devatas are at the second level. Devatas emerged from Parabrahma/ Parashakti and therefore are her children. They obey Her commands and perform the tasks allotted to them. The birth of the Trinity as children of Mother Anasuya highlights this fact.\n\nWe humans (manushya) worship the Devatas and procure their grace. For every desire of ours to be fulfilled, we need to approach the Devatas. We approach Parabrahm only to seek merger into Him. This is the command of that Almighty. Sadhana is the process of merging into the ultimate Supreme Parabrahma. Devatas also contemplate and meditate so as to merge into Parabrahma. That is why Shiva is always shown as seated in deep meditation."
}