{
  "number": 323,
  "name_devanagari": "कदम्बकुसुमप्रिया",
  "name_transliterated": "Kadamba-kusuma-priyā",
  "meaning": "Flowers of the kadamba tree are very dear to Her.",
  "commentary": "In the nama 60, kadamba tree and its significance was detailed. ‘Kam’ also means wind. Kadamba tree dispels wind-related disorders (vaata dosha) within the body. Hence the Supreme Mother loves this tree.\n\nThe above 3 namas ‘Kāmya, Kāmakalā rūpā, कदम्ब-कुसुम-प्रियाऽ (Kadamba-kusuma-priyā’) refer to the same essence and extol Her as Kāmya. The temple dedicated to this form of Mother Goddess is Kāmākhya temple in Assam. This temple is one of 18 shakti peethas of Devi.\n\nKadamba, Audambara (cluster fig), Tulasi (basil), Bilva, Ashwattha are medicinal and sacred trees. The Audambara leaves expel the poisons from our body. The poisons present in the stomach of the demon Hiranyakashipu, caused intense burning sensation in the fingers of Lord Narasimha who had torn apart the stomach of this demon. At such an hour, Goddess Chenchulakshmi applied a paste of Audambara leaves on to the Lord’s fingers, which cooled Him.\n\nBasil leaves (tulasi) dispel the heat (ushna) present in the atmosphere. When taken daily, they reduce the heat within the body and increase cool temperament in the individual. Bilva leaves cause good thoughts and good intellect to sprout within us. Bilva leaves symbolize the presence of the three traits (trigunas) within us.\n\nOffering these leaves to the Lord symbolize offering our trigunas.\n\nAshwattha (bodhi, peepal) is another auspicious tree. Idols of snake God are always placed beneath it. For a long time, people ridiculed the ancient custom that asked childless women to offer circumambulation (pradakshina) to this tree. There is a scientific truth hidden within this custom. Very often we come across people suffering from hormonal disorders. Hormonal disorders spring when the body lacks the required psychic energy (current); i.e. when the energy balance is not adequate.\n\nAll the leaves of the Ashwattha tree are eternally pointed towards the ground. Through these leaves, the tree constantly draws the energy from the earth into itself. Because of constant drawing of energy, this tree lives for thousands of years. When we offer pradakshina around this tree, this energy being drawn from the earth by the leaves, gets absorbed into our body. This sets right the hormonal imbalances in us. Women, who were unable to conceive due to hormonal disorders, get the capacity to bear children. For this reason, it is regarded as the king among trees."
}