{
  "number": 365,
  "name_devanagari": "स्वात्मानन्दलवीभूतब्रह्माद्यानन्दसन्ततिः",
  "name_transliterated": "Svātmānanda-lavī-bhūta-brahmādyānanda-santatiḥ",
  "meaning": "Word (padam) that existed merely as intent (sankalpa, apada) has now taken on a form and become audible. A pada (word, sentence) has been formed and has come out. Once the word is expressed it converts back into nāda (sound) and merges into the universe. He, who is able to visualize the distinction (vibhaaga) between the spoken word (pada) and apada (speech in its sound, naada form) is the true seer. He is a true jnani. He knows the judicious use of words.",
  "commentary": "Such bliss (ananda) is not externally available/ visible. She helps her devotee realize the ananda (bliss) that is inherently his by helping him understand about himself.\n\nThere are 11 levels of bliss with one level being more superior to the previous level by 100 times. At the bottom of the ladder is the human bliss (Manusha ananda). Manusha-gandharva ananda is the second type of bliss and is 100 times superior to the manusha- ananda. The third is the Deva-gandharva ananda, followed by Devata ananda, Pitru ananda and so on. Each of this also corroborates to the different stage of evolution and spiritual progress. As the soul goes higher up, it begins to experience one by one each of these stages of bliss. It is not compulsory that every level should be necessarily experienced.\n\nThe Divine Mother can, if She so wills enable her devotee to experience bliss that is far superior to any of those mentioned above, while he/she is still in the human body. Even the bliss of Brahma (Brahmānanda) fades in front of this bliss (ananda) bestowed by Her.The next few names explain how She exists in the form of our speech.\n\nThere are 4 stages in the formation of speech- Parā, Pashyanti, Madhyama and Vaikhiri. The word Parā means ‘that which is most superior and yet very subtle’ as in Paramātma, Para-tattva, Paramahamsa etc. Speech in the form of ‘पराऽ (‘parā’) exists at the intent level and is formed in the mind. Long before the word is uttered, the vital air vibrates at a very subtle level far beyond our understanding and the ‘intent to speak’ gets created in the mind. This is Parā. This state of ‘पराऽ (‘parā’) is far subtler than even the Mooladhāra stage and therefore people are not normally conscious about it. Only those who are at a very advanced level of self- realization can become conscious this stage of ‘Parā’.\n\nThis परा (parā) undergoes change of state with the help of the vital air (prāna vayu) and prāna shakti (life energy) and is now called ‘Pashyanti’. Pashyati means ‘one who is seeing’ (dhrsta). In general, seeing is of 3 types- a) seeing with the mind, b) seeing with the eyes or c) seeing with memory. Speech, that had so far been very subtle and beyond our awareness, now gets noticed by the mind. The Divine Mother, seated within us, is the first to notice it. The sound that was so far beyond the scope of Mooladhara, now fixes itself at the Anahata chakra. An action has taken place.\n\nIn the third stage, the word (Akshara) is born in the abdomen (naabhi sthaana). It then moves up with the help of vital air (Prana vayu). As it is now in an in-between state it is called ‘Madhyama vak’. The speech converts from intent to sound (naada). Such transformation takes place at the Vishuddha chakra (located near the throat).\n\nFrom the Vishuddha chakra the Sound (naada) jumps to the intellect (buddhi) and there it combines with the intellect and begins to flower. Sound that was so far pre-dominantly the form of wind (vaayu), is now of the fire element (agni swaroopa). Words distinctly clear and audible roll out from the mouth. It is now called Vaikhiri. Vikhari means loud, audible.\n\nUpon observing closely we understand that the roles of air (vayu) and fire (agni) are intertwined in every aspect of creation. Existence and vibration of air is a pre-requisite for the ignition and burning of fire. The spoken speech (vak) is the fire element. For this speech to emerge, the vibration of the vital air (prana vaayu) is a pre requisite.\n\nThis process is repeated for every single word uttered by us. She is the Mother for this entire process of speech and hence is Srimata. When the realization that speech is a form of the Divine Mother dawns upon the person, he will learn not to misuse it.\n\nUnderstanding the four stages of transformation of sounds helps us appreciate the role played by the Divine Energy in its creation. These 4 stages pass by in 1/100th of a second. This speed causes the ceaseless flow of words. But for this speed, we would experience faltering in speech. Lord Subrahmanya is the Lord who causes this wheel of speech to rotate at unimaginable speeds; hence He is the cause for sound (nāda) within us. He is both the Kundalini (nāga swaroopa) and sound (nāda swaroopa) within the being.\n\nApadam pada māpannam padamcha apadam gatamPadā pada vibhāgamcha ya paśyati sa paśyati.\n\nWords once spoken remain eternally in the universe in the form of sound. Such sounds encircle us and follow us during the entire lifetime. Like the Sudarshan chakra of Lord Vishnu, they protect the devoted or chase others. Either case, Vishnu’s feet are the sole refuge."
}