{
  "number": 376,
  "name_devanagari": "श‍ृङ्गाररससम्पूर्णा",
  "name_transliterated": "Śṛṅgāra-rasa- saṁpūrṇā",
  "meaning": "O Mother Goddess! After breaking through the subtle pathways, after having overcome the power of Mooladhāra, Swadhisthana, Anāhata, Manipura and Ajnā chakras, You reach the Sahasrāra chakra (the 1000 petalled lotus) and there you wander about freely with your consort.",
  "commentary": "Shrungara (love, attractiveness), hāsya (laughter, mirth), roudram (fury), kārunyam (compassion), bibhatsam (aversion, disgust), bhayānakam (fear, horror), vīram (heroic, valourous), adbhutam (wonder, amazement) and shanta (tranquility) are the nine emotions (rasas). Mentioning the first among them all implies that all the 9 emotions (rasas) are abundant in Her. Each of the 6 spiritual centers (shatchakras) is to be worshipped with one of these emotions (rasas).Shrungāra also indicates the stage of uniting into the supreme (aikya). In the 9th stanza of Soundarya Lahiri this rasa has been praised-\n\nMahim mulādhāre kamapi manipurē huthavahamSthitham svādhistane hridi marutamakasam upari;Mano’pi bhruu-madhye sakalamapi bhittva kula-pathamSahasrare padme saha rahasi पत्या (patyā) viharase\n\nThe verse ‘Saha rahasi पत्या (patyā) viharase’ is a yogic statement. Through intense yogic practices, the aspirant successfully carries the Kundalini energy to the Sahasrara. At this point the Kundalini merges with the supreme consciousness (shuddha chaitanya) which inherently exists there. This merger has been explained in the form of a simile of the Divine Mother wandering about happily with her husband. To re-iterate that this is a yogic state, the stanza uses the words ‘sahasrare padme’ (in the lotus called sahasrara).\n\nThose who misunderstand such yogic statements are ineligible and undeserving to even read or hear about it. Bhagavatam is a sacred text that explains the sports of that infinite Lord. When reading Bhagavatam, even if a sinful thought about the Lord comes to the mind, one should immediately close the book. This happens more so during the episode of raasa-kreeda. The sin that will attach on account of the bad thought relegates to the background any merit (punya) that would have accumulated. It is therefore wise to set aside the book under such circumstances."
}