{
  "number": 443,
  "name_devanagari": "तुष्टिः",
  "name_transliterated": "Tuṣṭiḥ",
  "meaning": "As Tushtih, She resides within us in the form of contentment and happiness.",
  "commentary": "She is the giver of happiness, contentment and joy. The mind of those who are truly happy and contented can be compared to a strong diamond. She is ‘Vajreshwari’ (one who controls the diamond).\n\nThe inner joy, happiness or contentment can be classified primarily into 2 broad categories- spiritual contentment (adhyātmik tushti) and materialistic/ worldly contentment (loukika tushti).\n\nSpiritual contentment (adhyatmic tushti) has various sub-classifications- Prakriti tushti, Upaadaana tushti, Kaala tushti and Bhagya tushti.\n\nPrakriti tushti- The contentment attained by the individual entity (prakriti) is Prakriti tushti. Prakriti is the individual nature (swabhāva). The restless wandering mind of the individual finds rest /peace at a particular place, say for instance, in the presence of his Guru. Here, the wandering mind has rested and is contented. This is a change that has taken place in the individual’s nature (prakriti) and is contented. This is Prakriti tushti.\n\nUpadāna tushti- The mind decides that a particular process, mantra etc. gives it endless happiness and reaches out to it. With this the mind remains in one place for longer periods of time and enjoys happiness, contentment.\n\nKāla tushti-  It relates to patience with respect to time (kāla). In general the mind is eternally in a hurry. Every person seeks that all his requirements are met instantly. For example, when he visits a temple, he demands instant darshan of the Lord and instant prasadam and is in a hurry to leave. Kāla tushti means developing patience with respect to time. Accepting to wait until the Lord gives His darshan, agreeing that worship (upasana) will take years to produce results and yet continuing it are qualities of a person who enjoys kāla tushti. Patience is the greatest perseverance.\n\nBhagya tushti- This is the satisfaction derived from Guru/God’s blessings (anugraha). This means to be contented with what is given by the Lord. Realizing that Guru’s grace (anugraha) is the sole wealth and the entire prosperity that one can get is bhagya tushti.\n\nThese 4 are the core essentials for spiritual progress.\n\n1) Worldly contentment (loukika tushti)- This is the satisfaction that is essential to survive happily in this universe.\n\nIt is said that to be contented with respect to worldly aspirations, it is essential to notice the inherent defects (doshas) that exist within. Creating fear will never restrain the mind. Mind has a tendency to crave for those comforts from which it has been deprived. It is only through a proper understanding of the defects hidden behind the enjoyment that the mind stops asking for them.\n\nFor example, the mind of a person who has been forbidden from eating sweets always runs behind sweets. At such times, understanding the dangers of eating the sweet will act as a restraint for the mind and he will thereby enjoy peace. The sub-classifications of loukika tushti are-Arjava dosha- When the difficulty, efforts and pain that needs to be undertaken to earn wealth is understood mind will be content with that which is earned.\n\n2) Rakshana dosha – When the efforts needed to protect wealth and the danger behind protecting too much wealth that has been earned is understood clearly by the mind then the mind stops seeking excess wealth and thus enjoys lasting peace. This is called rakshana dosha.Kshaya dosha- When the mind understands that the object is perishable and transient in the end, then it also realizes the foolishness in trying to possess it. Such thinking paves the way towards spirituality.\n\n3) Bhoga dosha – Understanding the defects and dangers behind the luxuries and enjoyments prevents the mind from desiring more of it.\n\n4) Himsa dosha – This is one more way to protect the mind. The person who is earning can enjoy contentment only when he understands that what he is enjoying today belonged to someone else yesterday. A person’s earning is always another’s loss. This is a himsa (injury) to the one who has lost it. Such understanding will cause in him contentment with what he possesses and also instill in him a trait of sharing his wealth with the down trodden.\n\nThe Supreme Mother out of her limitless compassion causes in us such contentment (tushti). Hence she has been aptly praised in Chandi Saptashati as –\n\nYaa devi sarvabhooteshu tushti roopena samsthithaa,Namas tasyai namas tasyai namas tasyai namo namaha."
}