{
  "number": 456,
  "name_devanagari": "हंसिनी",
  "name_transliterated": "Haṁsinī",
  "meaning": "The four Vedas—namely the Rig, Yajur, Sama and Atharva Veda all emanated from the breath of Paramatma.",
  "commentary": "The unique feature of a swan lies in its ability to separate milk components from that of water in a given mixture. Thus it represents the ability to distinguish between good and bad. The Divine Mother possesses the rare ability to distinguish and discriminate between those which are permanent and those that are perishable (nitya anitya), truth- untruth (satya asatya), saara asaara, jada ajada (inanimate animate).\n\nHamsa (so-ham, ham-sa) refers to Pranayama and to the relentless japa (ajapajapa) done by the individual. Japa comprises of mantra recitation. Mantras are composed of seed letters. These seed letters have their origin in alphabets (aksharas). To those who are able to visualize these seed letters (beejaksharas) within the six chakras (spiritual centres of the body) She gives Her darshan as a Swan (Hamsini). In other words, She blesses them with the ability to distinguish the real from unreal, good from bad etc.\n\nBreathing is a routine activity undertaken every second of life. Inhaling and exhaling are referred to as Ham-sa and So-ham respectively. It means ‘I am a swan’. Every breath re-iterates this feeling – I am a swan. It means that we are trying to inculcate the qualities of a swan and reaching a stage wherein we are able to pick only the good out of the mixture of good and bad/ pick only the truth out of the mixture of truth and untruth. (Refer to Guru gita, shloka ‘hamsaabhyaam parivrutta’).\n\nAmong the duties mandated to every individual soon upon waking up are certain prayers. The first step upon waking up is to sit on the bed, look at the palms and offer the following prayer to the 3 Goddesses that dwell there-\n\nKarāgre Vasate Lakshmi, Karamadhye SaraswatiKarmule sthithe Gowri, Prabhate kara darshanam\n\nAfter this prayer, the person should visualize his Guru as seated on his Sahasrara chakra and offer a prayer to Him. Thirdly pray to Mother Goddess Earth who sustains, takes our load, feeds and nourishes us. As we will be stepping and walking upon Her the entire day Her permission is sought. Fourthly, the person should make an intention (sankalpa) for offering his entire day’s breath (hamsa) to Goddess Gayatri. The day should begin with such intention. Then the breath taken will grant good health and longevity.\n\nNumber of breaths that should be thus offered to Mother Goddess is also elaborated in our sacred texts. Let us briefly discuss it.\n\nGanapati is the presiding deity of Mooladhara Chakra. To Him 600 breaths (hamsa japa) should be offered in a day. Swadhisthana Chakra is the place of Brahma. Here the Mother Goddess should be offered 6000 breaths. To Vishnu, who is situated at Manipura Chakra 6000 breaths are to be offered. Anahata Chakra is the seat of Shiva and here again 6000 breaths is to be offered. Vishuddha Chakra (throat) is the position of the life energy and here 1000 breaths are offered to Mother Goddess. At the location of the Ajna chakra, the seat of Paramatma, 1000 breaths are offered. Sahasrara is the seat of the Guru. Here again 1000 breaths are offered to Divine Mother who is in Her form as Guru. The total is 21600. This is the ideal number of breaths that should be taken during a span of 24 hours.\n\nHow was this number of 21600 arrived at? The Brihad-aranyaka Upanishad explains this in the following verse-  asya mahato bhutasya nisvasitam etad yad rg-vedo yajur-vedah samavedo ’tharvangirasah.\n\nParabrahma got the initial intention to create and He exhaled once. From his exhalation the 4 Vedas emerged in the form of sound and spread in all directions. This is the first sound; the big bang. The first of the 4 Vedas is Rig Veda and it has 21600 divisions (Rik). When each breath is taken with the feeling that a Rig Veda incantation is being offered to the Divine Mother, it becomes a Rig Veda upasana. Thus every person has the ability to offer entire Rig Veda incantation to the Mother Goddess every single day."
}