{
  "number": 567,
  "name_devanagari": "भक्तनिधिः",
  "name_transliterated": "Bhakta-nidhiḥ",
  "meaning": "She is the reservoir (treasure house) for all devotees (bhaktas).",
  "commentary": "One should dip into the reservoir only during dire emergency and not otherwise. This is the sacred reservoir that comes to the aid at times of extreme distress.\n\nA king was once very fortunate to get the services of a very able and knowledgeable minister. The minister handed him a ring that had a sacred mantra inscribed within it. The king was advised to open the ring and read the mantra only at times of extreme distress. Long after this incident, enemies lay siege on the kingdom. The king lost the battle and was fleeing. The enemy soldiers continued to chase him. After a long journey, deep in the forest, the king’s horse tripped and the king was thrown into a dark dingy cave. He realized that the enemy soldiers had seen him fall into the cave. It was now only a matter of time before he would be beheaded. Just as he was trying to stabilize himself in the cave, the floor gave way and he was hurdled further deep into the cave. The large stone that had given way again re-positioned itself blocking all light from coming in. The king was now really doubtful of surviving. He had reached a near-death situation.\n\nHe could hear the enemy soldiers enter the cave. Now very sure of his impending death, he opened the ring. What does he see? Instead of a mantra (sacred chant), he finds a message- this too shall pass. Needless to say, he was annoyed with his minister. Meanwhile the enemy soldiers failed to locate him in the cave and shortly thereafter he could hear them leave. He waited for a long time and then with some effort pushed the stone that had covered the hole. He came out and found that his horse was waiting for him there. Joyfully he got on it and rode to the city. Enemies were camped everywhere. He carefully gathered his loyalists and with their help pulled up his army and waged a war. Taken by surprise the enemy king lost the battle and fled the city.\n\nAfter the things had settled down, the king asked the minister the reason for placing a message instead of the mantra in the ring. The minister replied- O king, this is the mantra. Having faith that even difficulties will tide away and having faith in God is the mantra. Every bad situation is sure to pass.\n\nOne should have such confidence in facing the hurdles of life. Only when situations go far beyond this, the reservoir should be dipped into.\n\nKuchela was Krishna’s childhood friend. His original name was Sudama, but due to the dire poverty that he faced in life he was addressed as Kuchela. Kuchela means ‘he is dressed in dirty or tattered garments’. This name itself describes the extent of poverty faced by him in life. After living thus for many years, unable to bear the constant nagging of his wife, he finally set out to meet and seek help from Krishna. He was so poor that he could not even buy decent gifts for his dearest friend Krishna. All he could take was a few handfuls of puffed rice for the Lord. The Lord with great love received his childhood friend even though the latter was in tattered clothes. He showed Kuchela all his riches, his personal belongings, cows etc. He then took him to his personal quarters, seated him on his bed and washed his feet. He recollected all the events of childhood. With great hesitance Kuchela handed over to him the packet of puffed rice that he had carried. The Lord was overjoyed with this gift. He took two fistfuls of the puffed rice and put them in his mouth. When he was about to eat the third handful, His consort Rukmini, who was none other than Goddess Lakshmi, stopped him. She said, ‘O Lord, by eating 2 handfuls you have showered on your friend all your wealth. By taking the third handful, even I (Lakshmi, entire prosperity) will have to follow him’.\n\nKuchela took leave of his friend and began to walk back home. The Lord did not even ask Kuchela even once about his financial status. Slightly disappointed, yet happy with his visit, Kuchela slowly walked back to his hometown singing praises of Krishna all along. When he reached his hometown, in the place of his hut stood a large mansion filled with gold and riches. His wife and children were all decked in silks and gold. This story is a proof that Krishna is a bhakta nidhih.\n\nGuru too is a reservoir, a very large bank that rushes to our aid at times of intense emergency."
}