{
  "number": 570,
  "name_devanagari": "मैत्र्यादिवासनालभ्या",
  "name_transliterated": "Maitryadi-vāsanā-labhyā",
  "meaning": "Commentary:",
  "commentary": "She can be reached only through good traits/ qualities (sadgunas) such as maintaining friendship with the devout, having pure devotion, a pure mind, feelings of equanimity, compassion towards the needy and so on.\n\nMaitre refers to friendship. It shows the inclination or friendliness towards good deeds, good people and saints and entertaining good thoughts. Friendship with God is the best friendship.\n\nMaître (good friendship), karuna (compassion and help towards the needy), mudita (complacency and joy in good deeds) and upeksha (disregard for evil) are described as the 4 highest qualities to possess.\n\nUpeksha means to disregard and abandon bad people and bad thoughts. Even thinking about bad people is harmful. We become like the people we think about. The persons who possess the following 9 traits are referred to as mahatmas. They are-Vaancha sajjana sangame- these are people who eternally desire to spend time in holy company, who seek only good and healthy friendships. They recapitulate the good words that they have heard and are eager to undertake Sadhana.\n\nPara gune preeti-  they have true love towards good traits seen in others. Even the slightest good change (trait) seen in others should be seen with feelings of love and be adored. Do not see the faults in others. It is the responsibility of God to find the faults in people and correct them.\n\nGurur namrata-  they are humble and modest in front of the Guru.\n\nVidyayam vyasanam-  they have profound interest towards good knowledge and simultaneously give up bad habits and tendencies that cause sorrow to the body. It is transferring the interest that exists in bad habits towards acquisition of good knowledge.\n\nSvayoshiti ratih – maintaining feelings of love only towards the legally married spouse. Every other woman should be looked upon only as a mother. There should be good understanding between the couple.\n\nLokaapavaada bhayam –  the fear of society and of ill fame should exist. Even where the mind is wavering, such fear should act as a tool to prevent the person from person from evil deeds.\n\nBhakti shoolini – devotion towards Lord Shiva should be manifold. This will lead towards detachment.\n\nShaktir atmadamane- controlling the senses is essential.\n\nSamsarga mukti khale- giving up all thoughts about the people with bad tendencies. Association with evil will cause evil thoughts to enter our mind.\n\nThese 9 are pure traits. The one who possesses these traits is a true saint. Obeisance should be offered to such a saint."
}