{
  "number": 578,
  "name_devanagari": "महाकैलासनिलया",
  "name_transliterated": "Mahā-kailāsa-nilayā",
  "meaning": "Mahā-kailāsa is Her residence.",
  "commentary": "She resides here in Her from as Gowri, Parvati. She is the source of all energy. Seated here She is blessing the entire creation. She heads all the troops of Shiva (Shiva Ganas).\n\nKailāsa is Shiva’s residence on the Earth. Mahā-Kailāsa is the residence of Shiva in the great space (antareeksha). It is at a much more subtler plane. As His spouse the Divine Mother resides there.\n\nEvery atom on earth is sacred. At every step there are scores of Shiva Lingas. When Arjuna was about to depart for Kashmir, Krishna had for him a special advice. He said that that every atom of that land was a Shiva Linga and hence Arjuna was asked to recite the name of Shiva at every step.\n\nIn any house, a kitchen has a function that is completely different from a bathroom or a bedroom. Likewise every house a special place created where prayers can be said or where God is invoked. This place has special value and significance in the house. Likewise on this earth, God has selected certain lands known as kshetras that are to be the puja rooms (prayer halls).  At these special places, great saints have invoked the Lord and consecrated him. Hence the area reverberates with divine vibrations. God resides at such places. Such places include the 12 sacred places of Shiva (Jyotirlingas), the eighteen sacred places of Devi (asthadasha shakti peethas), the various temple towns pertaining to Vishnu, Subrahmanya, Ganapati and so on.\n\nKailāsa is one such sacred place. It is the temple of God. It is located in the land of Tripeetha, now known as Tibet. Eons back the land of Bharat (India) stretched from Tripeeta desha (Tibet) up to Afghanistan. Kailāsa is the airport for the Devatās who seek to land on earth and hence it is filled with limitless divine vibrations. Shiva along with Parvati, Ganapati, Subrahmanya and the hordes of troops resides here. The area has a magnetic appeal. The Kailasa Mountain is ever covered with snow even in the summer months. Heat and cold winds blow simultaneously. In the mornings, the sunrays fall on the mountain and give the impression of a crown to Lord Shiva. Just as much rays as are needed to create a crown fall on the mountain. Evening has a mix of unique colours. The Devatas eternally bathe in the Manas-sarovar Lake. The Kailāsa Mountain is 13000 feet high single rock. How far beneath the earth it stretches no one knows.  Being at a high altitude, there is shortage of oxygen at this point. No plants can be visible in the surroundings.\n\nIt is said that the Lord laughed in joy and this reflection (image) caused the shining in the Kailasa Mountain.  The shine on the mountain thus is the reflection of his bliss (ananda) and hence this area is filled with bliss. In this bliss, he continuously performs the tandava (keli or dance of bliss). Lāsa stands for dance, sport. The dance of supreme Mother is known as lāsa. Hence Kailāsa is the place where both the Supreme Mother and Supreme Father are performing the dance of bliss.\n\nMaha Kailāsa located at a much subtler plane stands for supreme bliss (महा ((mahā) ananda, the dance of supreme bliss)."
}