{
  "number": 608,
  "name_devanagari": "दण्डनीतिस्था",
  "name_transliterated": "Daṇḍa-nītisthā",
  "meaning": "Drive away from within me all traits of immodesty and arrogance O Lord Vishnu. Teach me to be humble at all times especially towards my Guru and all my elders. Subdue and tame my mind (damana) and prevent it from running away in all directions. Controlled by my senses, my mind is running after all the sensual desires that are nothing but a mirage. Help me control my senses. Let compassion towards all beings (bhootadaya, universal compassion) engulf me. Please help me cross the ocean of this samsara (bondages).",
  "commentary": "a) Sadhana conducted by the yogis is also known as danda. Yogis hold the stick known as danda in their hands. She resides as the ethics (neeti) within that Sadhana (danda).\n\nb) The Supreme Mother resorts to imposing punishments (Danda neeti) at times when necessary and hence is दण्ड-नीतिस्था। (Daṇḍa-nītisthā.)\n\nArtha shastra (an ancient Indian treatise on statecraft, economic policy and military strategy) contains many ethics (neetis). They include the different levels of persuasion tactics to accomplish the task on hand. The kshatriyas (rulers) could use different political methodologies that primarily included ‘Sāma’ (gentle persuasion), ‘dāna’ (offering of wealth, money), ‘bheda’ (usage of threats) and ‘danda’  (punishment or violence) to accomplish the task. Among the four, Danda assumes importance as it highlights their power and might.\n\nOur prayer to Lord Vishnu in the Shatpadi Stotram is –\n\nAvinaya mapanaya vishno damaya manas samaya vishaya mrga trshnāmBhūta dayām vistāraya tārāya samsāra sāgaratah.\n\n‘Damana’ is to tame and subdue (punishment). The mind needs this taming and hence in the above-mentioned shloka there is a prayer to the Lord Vishnu to this effect.\n\nIn the 10th chapter of Bhagavad Gita, Lord Krishna states –\n\nDando damayatam asmi  nitir asmi jigishatam\n\nHere Krishna states that He is the danda (stick) that metes out punishment when the need to subdue arises. He is the neeti (wisdom, proper ethics, right behaviour) in those desirous of victory. He is both Danda and Neeti.Thus the Supreme Mother is both Dandaneeti and Danda and Neeti separately. All ethics (neeti) arise out of Her. Yet, at the same time, She is the stick (danda) that imposes punishments and She is the dandaneeti."
}