{
  "number": 669,
  "name_devanagari": "अन्नदा",
  "name_transliterated": "Annadā",
  "meaning": "When the food is pure, then the intellect (buddhi, the inner senses) gets purified.",
  "commentary": "In the very first name of Savitri vidya, the result (phala) of undertaking Savitri upasana (Savitri worship) is elaborated.\n\nNot all food that we eat can be defined as ‘annam’. Only that food which passes on the traits of purity (Sattva guna) to the person consuming it can be defined as ‘Annam’. That food which causes a change/transformation in our intellect (buddhi) cannot be defined as annam.\n\nOur Vedas have declared- Ahara shuddhou sattva buddhih-\n\nThe Divine Mother blesses Her devotee with such pure food. From food comes knowledge (Jnana).\n\nIn the Annapurna stotram (hymn) Sri Adi Shankaracharya glorifies Her as –\n\nnityānandakarī varābhayakarī saundarya ratnākarīnirdhūtākhila ghora pāvanakarī pratyaksa māheshvarī |\n\nFurther down in the hymn, he extols Her as –\n\nannapūrne sadāpūrne shankara-prānavallabhe |j̇ñāna-vairāgya-siddhayarthaṃ bikshāṃ dehi ca pārvatī\n\nO Mother! You are the giver of plentiful food.  You are the prana (life force) of Shiva. Through this pure and sacred food, help me develop knowledge (jnana) and detachment/ renunciation (vairagya).\n\nFood is always purified before eating. To achieve success in Savitri Vidya it is very critical that the upasaka (worshipper) maintains the purity of food that he eats. He should maintain stringent rules regarding the food intake. To highlight this, the result of conducting the Savitri vidya has been specified as first and foremost nama in this vidya.\n\nWhy does food play such a critical role? Food has a very powerful energy associated with it. The intellect (buddhi) and mind (manas) get formed because of the food we eat. When pure food is taken in the proper procedure at the right hours and in limited quantities it aids the growth of a pure intellect. Such pure intellect is essential to move in the path of worship, prayers etc. The Divine Motehr who blesses with such food is Annadā.\n\nThe stringent rules regarding food were born out of this. Our scriptures specify the places and houses where one can eat food. The source of the last meal eaten by a person before his death determines his future birth. This is because the person remains indebted (runa) to that person who provided him/her the last meal. He will have to be reborn in that house to repay this debt.\n\nUnder no circumstances should a person eat in that house/function in which he/she has been uninvited. Even when the person has been duly invited, there are many rules regarding food.\n\nImpure food weakens the power of the senses (indriyas) and makes them act in opposition to the will. There are 3 types of defects that make food impure – Jāti dosha, Ashraya dosha and Nimitta dosha.\n\nJati dosha – In this, the very nature/ family/ class to which the food belongs gives it its defect. For example- onion and garlic. These have a stimulating/ exciting tendency. When such foods are eaten they produce restlessness of the mind and disturb the intellect (buddhi).\n\nIn addition, the person who consumes raw onion or garlic emits profuse strong odour and it is very difficult even to come within taking distance from him. This causes himsa (trouble) to others. Thirdly, these items when consumed regularly cause irritation in the stomach and result in acidity related issues. Therefore, even among vegetables, those that cause harm (himsa) to the self and to others have been declared as defective foods (jāti dosha).\n\nAshraya dosha – The Sanskrit word ‘ashraya’ means ‘shelter’. According to this, the nature of the person/ home from whom the food comes determines whether it is pure or not.\n\nEach man has a certain aura around him and this aura gets transferred to every item/ thing that belongs to him or is touched by him. Just as milk stored in a copper (ragi) vessel turns impure due to contact, food (that has its source) coming from a wicked person/house will cause impure and wicked thoughts in the person who consumes it.\n\nNimitta dosha – This is the impurity that comes to food due to dirt, dust and other such agents in it. The impurities in the water used for plantation, the kind of manure used etc. can cause certain germs to breed in the vegetables (food). Thus it makes the food defective and unworthy for consumption.\n\nLikewise, eating of meat is forbidden. Killing the animal for its meat causes it pain (himsa, injury) and hence should not be eaten."
}