{
  "number": 959,
  "name_devanagari": "धर्मवर्धिनी",
  "name_transliterated": "Dharma-vardhinī",
  "meaning": "Controlling the indriyas, maintaining cleanliness, entertaining only good thoughts and developing/ promoting bhakti are all acts of human dharma.The 10 qualities of dharma are-",
  "commentary": "Jitendriyatvam soucham ca mAngalyam bhakti revacaShankare bhaskare devyam dharmo yam mAnushya smrtah.\n\nDhriti Kshama Damo Asteyam Shaucham Indriya-nigrahahDheer Vidya Satyam Akrodho Dashakam Dharma Lakshanam\n\n(1) Dhriti – Courage (dhairya)(2) Kshama – Forgiveness and patience(3) Damah – Self Control(4) Asteya – Not Stealing(5) Shaucha – Purity(6) Indriya-nigraha – Sense Control(7) Dhi – Intellect(8) Vidya – Learning/ knowledge(9) Satya – Truth(10) Akrodha – Absence of Anger.\n\nWe need to periodically assess whether we are adhering to dharma or not. We should be our own witness. One who follows dharma is very dear to the Divine Mother. Sadhana that is undertaken for self-improvisation is called dharma. She increases this dharma within us.Each stage of life (ashrama) has different dharmas associated with it.\n\nThe Lord of Dharma (Dharma devata/purusha) has 13 wives and 13 sons. Let us understand the significance behind this statement.\n\na) Shraddha (dedication) is the first wife of Dharma and their offspring is Dhrtih (courage, dharana). Only when dedication towards adhering to dharma exists, then courage to abide by it (dhriti) follows automatically.  In other words, a person who is absolutely firm about following dharma will always find a way to stick to it. The weak minded find many obstacles coming their way in following dharma.\n\nb) The second wife is maître (friendship). Unless the person develops affinity/ friendship towards dharma he/she will never desire to implement it. Such friendship with dharma begets Prasada (Her blessings) . Those who love dharma and follow it are showered with her blessings.\n\nc) Daya (compassion) is the third wife and their offspring is abhaya (fearlessness). Compassion is essential to adhere to dharma. Compassion begets fearlessness.\n\nd) Shanti (peace) is the fourth wife and the offspring (result of adhering to peace) is sukha (happiness).\n\ne) Tushti (contentment) is the fifth wife and it begets muda (happiness). Contentment should be practiced willfully. Even salt-less food turns tasty when it is willfully put into practice.\n\nf) Pushti (strength) is the sixth wife and her offspring is smayah (pride, garva). Here the person should be careful and alert.\n\ng) Kriya (karma, action) is the seventh wife and Yoga is the child. Through practice of karma, Yoga is achieved. Karma gradually takes the person towards self-less action (nishkaama karma).\n\nh) The eighth wife is unnati (growth). The person who abides by dharma finds that praise, fame and growth (unnati) will follow quickly. Such state leads to ahamkara and this takes towards a steep downfall. Hence ahamkara has been stated as the offspring. Increase prosperity in wealth/ yoga means the person should be very carefully.\n\ni)\tBuddhi (good intellect) is the ninth wife and the result is artha (earnings).\n\nj)\tThe tenth wife is medha (intelligence) and the result is smritih.\n\nk)\t The eleventh is titeeksha (forbearance) and offspring is kshema.\n\nl)\tThe twelfth is Hreehi (modesty) and offspring is vinaya (humility).\n\nm)\tThe last wife is moortih (dharma moorti) and their offsprings are Nara-Narayana. The person who has all these above traits is a complete human being (Nara) and he will have darshan of Narayana.\n\nThe Divine Mother increases all these traits in her devotees."
}