{
  "number": 119,
  "name_devanagari": "भक्तिगम्या",
  "name_transliterated": "Bhakti-gamyā",
  "meaning": "Bhakti is a state of mind wherein all thoughts of the devotee automatically go and attach themselves to the lotus feet of the Lord just as the relationship that is maintained between the ankolam seeds and its tree; the needle and the magnet; the pativrata and her husband; the creeper and the tree; the river and the ocean.",
  "commentary": "There are 9 paths in devotion (bhakti). They are –\n\nश्रवनं किर्तनं विश्नोः स्मरनं पाद-सेवनंअर्चनं वन्दनं दास्यं सख्यं आत्म-निवेदनं (śravanaṃ kirtanaṃ viśnoḥ smaranaṃ pāda-sevanaṃarcanaṃ vandanaṃ dāsyaṃ sakhyaṃ ātma-nivedanaṃ)\n\n1) śravanam – hearing about the Lord2) Keertanam – singing about Him3) Smaranam – thinking about Him4) Pāda sevanam- offering service at His feet5) Archanam – offering Him worship6) Vandanam – offering Him obeisance7) Dāsyam – becoming His servant8) Sakhyam – friendship &9) Atma nivedanam – self surrender\n\nThe primary pre-requisite while abiding by these paths is to ensure that the mind is devoid of ego (ahamkara). Bhakti means, the mind should be fixed on the feet of the Lord devoid of any other thought, want and intent (sankalpas).\n\nSri Adi Shankara Bhagavatpādāchārya in His hymn ‘Shivānanda Lahiri’ gives 5 examples that explain the relationship that a true devotee has with His Lord.\n\nआन्कोलं (Ānkolaṃ) nija बेएज-सन्ततिः (beeja-santatiḥ) ayaskāntopalam sūchikaSādhvee naija vibhum लता (latā) kśitiruham sindhuh sarid vallabhamPrāpnoteeha यथा (yathā) तथा (tathā) पशुपतेः (paśupateḥ) pādāravindādvyam,Chetovrittir-upetya tiśthati सदा (sadā) सा (sā) bhaktirityuchyate.\n\nLet us understand how these 5 examples explain true bhakti.\n\na) Ankolam is a forest tree. When the fruits of this tree fall to the ground, its seeds liberate from the fruit, gradually climb up and get inseparably attached to the tree trunk.b) A needle that is kept in the proximity of a magnet (ayaskānta), always rushes and attaches to it. The mind of a true devotee likewise runs to thoughts about the Supreme.c) A pativrata (chaste woman, sādhvee who strictly adheres and follows her husband) without any deviation, eternally focuses her mind upon her husband, who to her is her God.d) A creeper (लता), ((latā),) attaches and winds itself around a tree (kshitiruha); likewise the mind of a real devotee always looks for ways in which it can wind and attach to the Lord.e) A river always flows fast and is restless, trying to reach the ocean, which is its Lord."
}