{
  "number": 156,
  "name_devanagari": "नीरागा",
  "name_transliterated": "Nīrāgā",
  "meaning": "She is over and above the feelings of like, dislike, attachment etc. (rāga).",
  "commentary": "(Rāga can be described as feelings of fondness, affinity, intense desire, attachment etc. towards a person/object. Dwesha can be understood as feelings of dislike, hatred, aversion or antipathy towards another object/being) – Source Internet.\n\nRāga is the basis for dwesha. Rāga should be overcome before dwesha can be attacked.\n\nOne of the first traits that assume power over an individual is the feelings of rāga – dwesha (likes and dislikes). This happens right from infancy when feelings such as ‘I, mine, my people, my things and my near and dear ones’ begin to form in the mind. With this, the feelings of like-dislike begin to sprout.\n\nLiving in such a state is like building a fence and living within those limited boundaries. These feelings are mental blockages that bind the person and impede spiritual progress. True ‘broad-mindedness’ should be from the mental perspective. At this highest level, this rāga turns into anurāga, a state wherein feelings of love and compassion towards the entire universe and towards all its beings, envelop the person. To inculcate such large- heartedness and universal love, we are customarily asked to pray to the Almighty for the welfare of others, at every step of our life. For example, before every meal, we pray to the Almighty and seek that every being in the universe is able to get food for the day.\n\nYou may then doubt as to why Krishna preached and instigated Arjuna to take up arms when the latter was displaying feelings of love and compassion (daya) towards his kinsmen in the battlefield. A very important point to be noted here is that dharma (righteousness) is the foundational root from which everything stems. Daya (compassion) is merely a branch of dharma. When the main root ‘dharma’ has been routed out what is the use of protecting its branch ‘daya’?\n\nArjuna’s compassion (daya) should have been towards the citizens of the land who were suffering under these unrighteous (adharmic) rulers; restoring their peace should have been his penance. Instead, he wrongfully developed feelings of compassion towards his kinsmen and sought to refrain from fighting. As this was incorrect, Krishna rightfully sought that Dharma should be restored."
}