{
  "number": 169,
  "name_devanagari": "क्रोधशमनी",
  "name_transliterated": "Krodha-śamanī",
  "meaning": "Desire and anger (Kama and Krodha) co-exist and emerge from the same root. Desire leads to anger and anger grows out of not having things our way. The root for this is rajo guna (rajasic tendencies) i.e. the desire to rule, to manage, to win and to have everyone else obey him or her.",
  "commentary": "Krodhayukto yadyajati yajjuhoti yadarchati |Sa tasya harate sarvamāmakumbho yathodakam ǁ\n\nThe primary procedure before beginning any vrata/ pujas is punyāvachanam (purification process). In this, the external surroundings as well as the inner mind are cleaned and purified. Pranayama conducted at the beginning of any puja or ritual serves the purpose of cleaning and calming the angry, agitated or tensed mind. Rituals without this cleansing serve no purpose.\n\nAnger is a dreaded enemy from which we stand to gain nothing but due to which we risk losing everything. Any task performed when seized with anger is a sheer waste.\n\nWhat was the difference between the yaagas or sadhana performed by Devatas and those performed by the demons? Devatas began all their Sadhana with a pure mind (sattvik) devoid of any evil intentions. There was no anger or hatred towards others. All they sought was protection. The demons on the other hand, took up intense spiritual practices with hatred and anger ruling their minds. They prayed for the destruction of others while trying to secure immortality for themselves. The prayers of demons were rendered fruitless.\n\nLord Krishna says in the Bhagavad Gita –\n\nकाम एस्ह क्र्ōध एस्ह रज्ō-गुण-समुद्भवह्।महासनो महा-पप्म विद्ध्य् एनम् इह वैरिणम्। (Kāma esha krōdha esha rajō-guṇa-samudbhavah.Mahāsano mahā-papma viddhy enam iha vairiṇam.)\n\nDesire and anger (kaama, krodha) have insatiable appetite and grow enormously. They know no contentment and finally lead the person towards crime and sin. For this very reason, they are the dreaded enemies who unfortunately reside within. The Divine Mother with her limitless compassion and grace can pluck them out."
}