{
  "number": 187,
  "name_devanagari": "निरत्यया",
  "name_transliterated": "Niratyayā",
  "meaning": "It is impossible to override Her dictates.",
  "commentary": "Guru’s orders (ajna) should be adhered to at all times and under all circumstances even if the remark/ order has been said jocularly or casually. Such should be the faith in the Guru. No one has an authority to override His dictates.\n\nLet us recollect a short story related to this. The Navanathas were special messengers of God and followed Datta tradition. The first Navanatha was Matsyendrianath and the second was Gorakhnath. It is said that when a barren woman approached Matsyendrianath for help, He blessed her with some Vibhuti. Not knowing its value, she threw it in a garbage bin. A small infant emerged out of this vibhuti and for 12 years a cow (go) reared him. Thereafter Matsyendrianath took him away and he came to be known as Gorakshakanath or Gorakhnath. He was a disciple of Matsyendrianath.\n\nOnce the Guru- disciple who were wandering, reached the outskirts of a town where they camped for a couple of days. At noon, Gorakhnath went to town to collect alms (bhiksha). He offered to his Guru the entire bhiksha that he had received. Matsyendrianath ate all that was brought and very casually remarked that he wanted more of it. The next second Gorakhnath went back to the same house and begged for alms. He pleaded with the lady that it was for his master. Hesitatingly, she gave him some more of that particular food preparation. Matsyendrianath ate it up completely and once again remarked- ‘I wish there were some more of this delicious food.’\n\nUnhesitatingly Gorakhnath went back to the same house even though his Guru had just made a mere passing remark about the food. This time however the lady demanded some compensation for the food and asked Gorakhnath to offer one of his eyes. Without a second thought Gorakhnath cut off one of his eye and offered it to her. He was more worried that he was delaying in serving his master. He tied a cloth around his eye lest his master notice the missing eye. Receiving the bhiksha brought by his disciple, the master enquired about the cloth tied across his eye.\n\nGorakhnath tried to dissuade him from doing so but then finally had to tell the entire truth. The Guru said- ‘O is it so? Let me have a look at the wound’. Gorakhnath untied the bandage. What a surprise! His eye was unharmed! This brought about a complete transformation in Gorakhnath and led him to greater levels in spiritual progress."
}