{
  "number": 381,
  "name_devanagari": "रहोयागक्रमाराध्या",
  "name_transliterated": "Rahoyāga-kramāradhyā",
  "meaning": "She is worshipped through the secretive rituals (raho yāga).",
  "commentary": "Secretive rituals/ sacrifices do not mean performing yāgas is isolation or in absolutely deserted places. It refers to the inner rituals/ worship (antar yāga) performed routinely by the person without any propaganda.\n\nWhile discussing the criteria for attaining moksha (liberation), Vedas chose to state the conditions that automatically disqualify a person from attaining liberation. To understand the true meaning of the phrase ‘raho yāga’ these disqualifications should be understood.\n\nNa sabda shaastraa bhiratasya mokshoNa chaiva ramyaa vasata priyasyaaNa bhojanaa chaadana tatparasyaaNa loka chitta grahane ratasyaaEkaanta sheelasya drda vratasyaaMoksho bhavet preeti nivartakasyaaAdhyaatma yoge niratasya samyakkMoksho bhavet nityamahimsa kasyaa.\n\nNa sabda shāstrā bhiratasya moksho –\n\nPeople who suffer from the ego/pride of knowledge (vidya ahamkara) and who argue/ counter argue with their knowledge are far from liberation. Such people are trapped within the limits of their high learning and knowledge ‘Sabda jālam महा (mahā) aranyam’- words (knowledge) spin a web that is similar to a huge inescapable forest.\n\nन छैव रम्या वसत प्रियस्या – (Na chaiva ramyā vasata priyasyā –)\n\nPeople who crave for materialistic comforts and prosperity are also ineligible for liberation.\n\nन भोजना छालन तत्परस्या – (Na bhojanā chālana tatparasyā –)\n\nThose who worry and plan about their daily meal and daily comfort are also ineligible for liberation. There should be no thought in the mind about the next meal.\n\nन लोक छित्त ग्रहने रतस्या – (Na loka chitta grahane ratasyā –)\n\nThere is no use of intense sadhana, if one is unable to give up the desire to probe into other’s minds, find faults in them or criticize their habits and wrong doings. One should seek to know only his/her own mind.\n\nएकअन्त स्हेएलस्य द्र्द व्रतस्या – (Ekaanta sheelasya drda vratasyā –)\n\nOnly He who enjoys being alone (ekanta) and who is firm about his practices is eligible for liberation. Being alone does not mean shunning society but implies that the person should be so involved in the task at hand that he forgets the entire society and the people surrounding him.\n\nViewing spirituality (adhyatmica) and materialistic life (loukika) as two separate compartments that do not blend is a grave mistake. These are 2 intertwined threads. While living within the society and being a part of it, one should continue his/her spiritual efforts. It is impractical to run away from the society and sit in a cave and meditate.\n\nमोक्स्हो भवेत् प्रेएति निवर्तकस्या – (Moksho bhavet preeti nivartakasyā –)\n\nOnly such persons who enjoy being alone (ekanta) and who are able to willingly give up love and other emotions (rasas) are eligible for liberation.\n\nAdhyātma yoge niratasya samyakk –\n\nThe person should be able to get into the path of spirituality without any fear and hesitation.\n\nमोक्स्हो भवेत् नित्य अहिम्स कस्या – (Moksho bhavet nitya ahimsa kasyā –)\n\nIn addition the person who practices non-injury (ahimsa) is eligible for liberation. Ahimsa should be practiced on the physical, verbal and mental planes. One should not harm others even in dreams. If possible correct others, but never criticize them. By criticizing and finding faults in others we are attracting those qualities on to ourselves. Through constant thinking about demon Kamsa or Ravana we imbibe their demonic qualities. Likewise constantly thinking about Rama or Krishna helps us develop divine qualities.\n\nMoksha is not a state that can be attained after death. Persons with such divine qualities will enjoy liberation while living (jeevan mukti)."
}