{
  "number": 420,
  "name_devanagari": "गायत्री",
  "name_transliterated": "Gāyatrī",
  "meaning": "O Lord Sun! You are brightest illumination (varenya). I am offering my worship to you. By doing so, I will get a tinge of your illumination. May such illumination shine within me. Please direct my intellect towards the ways of dharma.",
  "commentary": "Mukta-vidruma – hema-nila-dhavala-chayair mukhair-tryakshnaih,Yuktam indu-nibadha-ratna-makutam tatvarthavarnatmikamGayatrim varadabhayankusa-kasam subhram-kapalam gadamSankham chakram atha aravindayugalam hastair vahantim bhaje\n\nMeaning: Her five faces are tinged with shades of pearl, coral, gold, sapphire and white. Her 5 faces and 5 colours symbolize the 5 sheaths within the individual (pancha kosha), the 5 duties (pancha krtyas) and the 5 stages through which he needs to pass.\n\nShe is the cause of inspiration (prachodana) to the Sun itself. She also causes inspiration (prachodana) to those who recite the Gayatri mantra. As She enables the person to attain self-realization and see the light that is within, She is extolled as Savitri. She wields the goad (ankuśa), the whip (paśa), the white skull, the mace, the conch and the discus. She holds a pair of lotuses in each hand and with the other two hands, displays the mudras conferring boons and fearlessness.\n\nIn the worship of Gayatri the meditation (dhyana) shloka is on Gayatri Devi, while the presiding deity of the mantra is Savita (Sun God). The meaning of Gayatri is explained in the shloka:\n\nYo deva savita asmakam dhiyo dharmadi gocaraahPrerayet tasya yad bhargah tad varenyam upasmahe\n\nGayatri Devi is not a deity. A form has been given to the essence of the Supreme Knowledge and it has been named ‘Gayatri’. She teaches the Supreme essence.\n\nThe person, who has been initiated into this Gayatri mantra, worships Her at every Sandhya period (twilight) and begs from Her prachodana (inspiration) to his intellect (buddhi). There is no mantra greater than Gayatri mantra. All those who have taken initiation of this mantra should mandatorily complete their recitation (anushthana) of this mantra daily before undertaking other mantra recitation. This is their foremost duty. Those who have not received this Gayatri initiation should complete the recitation of the Guru given mantra before proceeding for other anusthana.\n\nEach deity is said to have its own Gayatri- Garuda Gayatri, Ganapati Gayatri, Lakshmi Gayatri and so on.\n\nReciting or recollecting just a few verses of Ramayana at the evening twilight (Sandhya) time, especially the Sundara Kanda, bestows the benefit of reciting Gayatri mantra. Goddess Gayatri has incorporated the entire essence of the Vedas into 24 syllables and handed it over as Gayatri mantra. Regular recitation of this mantra will take the person to a state above the five sheaths (pancha koshas) and bless him with infinite bliss.  Those who are endlessly reciting it are participating in causing the welfare of this universe; they are uplifting this universe.\n\nb) Gayatri means that She protects those who sing (gānam)."
}