{
  "number": 436,
  "name_devanagari": "कुशला",
  "name_transliterated": "Kuśalā",
  "meaning": "He whose mind is verily fixed in yoga and whose mind being in a state of equilibrium sees happiness and dejection alike, frees himself from the pāpa (sin) or punya (merit) attached to the deed. Work thus performed is yoga. This is the true state of Kuśalatva.",
  "commentary": "Generally the word kuśala refers to the overall well-being or health of the person. But in reality, well-being stands for fitness and regularity in yoga, non-disturbance towards all the spiritual disciplines, discharge of karma and unfailing adherence to dharmic practices. It is the state of a true karma yogi.\n\nDefining the term Kuśala, Bhagavad Gita states-\n\nyoga-sthah kuru karmani sangam tyaktva dhananjayasiddhy-asiddhyoh samo bhutva samatvam yoga ucyate\n\nIt is the mind’s nature to be elated at times of happiness and dejected at times of sorrows. By remaining undisturbed, the mind remains calm.\n\nBuddhiyukto jahati’ha ubhe sukrta-duskrtetasmad yogāya yujyasva yogah karmasu kauśalam.\n\nThere is a beautiful saying- Sow an action and reap a tendency. Sow a tendency and reap a habit. Sow a habit and reap a character. Sow a character and reap a destiny. Thus you are a creator of your destiny. Do it or undo it.\n\nThese statements beautifully detail the process to reach the stage of yogic well being (kushala). Sow an action means perform a good karma (for instance, doing japam). Repeating the action regularly will create a tendency, an inclination towards performing the same action (samskaara). Mind will be drawn towards the action. Gradually it forms a habit. A good habit brings about a good character. A good character can reward the person with a good destiny. Destiny thus is not something thrust upon us by a supernatural force but is something that can be created out of repetition of good karma.\n\n‘Kusha’ also means a blade of grass. From this we understand that the Divine Mother is as sharp as a blade of grass. From grass we learn not to hurt others, always to be useful and humble. Rama’s first born was named Kusha- to indicate that his intellect would be as sharp as a blade of grass. She shines in the form of sharp intellect in those devotees. Such sharp intellect and expertise is a primary requisite for karma yoga."
}