{
  "number": 438,
  "name_devanagari": "कुरुकुल्ला",
  "name_transliterated": "Kurukullā",
  "meaning": "I contemplate upon Goddess Kurukulla who is seated majestically upon the Kuruvinda gems. She resembles the Mountain Meru and She is extremely pleased with the offering of kumkuma. Mentally I offer prostrations to you O Kurukulla Devi and request you to always remain with me.",
  "commentary": "There is a well, named ‘Vimarshana’ near the residence of the Divine Mother (manidweepa). Goddess Kurukulla is the presiding deity of this well (adhishtana devata).\n\n‘Vimarshana’ means ‘to analyze, to dig deep into and to reflect’. This human body is a Srichakra. ‘Kuru’ emphasizes upon the necessity of going deep inwards, analyzing and reflecting through yogic pursuits. Try to experience the truth behind all the truth that has been heard.\n\nThe first verse in the holy text Bhagavad Gita is-\n\nDhrtarastra uvaca – (Dhrtarastra said)\n\nDharma-ksetre kuru-ksetre samaveta yuyutsavahmāmakāh pāndavās caiva kima kurvata sanjaya.\n\nWhat is the hidden meaning implied in this verse? Let us analyze-\n\nDharma-kshetre –  It refers to this body that has been filled with the entire pre-requisites necessary to abide by dharma (righteousness).\n\n‘Kshetra’ refers to this body. As this body has been given exclusively for following dharma, it is a dharmakśetra.\n\nKuru-kśetre- ‘Kuru’ means ‘you do’ or ‘perform’. For example, ‘Karma kuru’ means ‘perform action’. This body has been given for performance of mandatory duties. Hence it is Kuru-kshetra. Kurukshetra means ‘field of action’.\n\nSamaveta yuyutsavah – in such body (kshetra) all have assembled.\n\nLet us analyze who all have assembled.\n\nMāmakāh – those related to me i.e. traits of activity and inertia (rajo guna and tamo guna) or the traits that need to be triumphed over.Pāndavah – those related to Pāndu. Pāndu means white colour (shweta) or traits of purity (sattva guna).\n\nKim kurvata –  What will be the outcome of such a war?\n\nSanjaya –  The result will be ultimate victory i.e. traits of purity (sattva) will triumph over the other two traits.\n\nOur body (kshetra) is the battlefield between the traits of inertia and activity (tamo and rajo guna) on the one side and traits of purity (sattva guna) on the other. This body is the dharma-kshetra where dharma should finally reside. Ultimately the traits of purity destroy the unnecessary traits and then dharma prevails.\n\nKurukulla Devi thus blesses us with power of discrimination (Vimarsha shakti) through which gradually the traits of purity will triumph. She bestows traits of purity.\n\nKuruvinda taruni nilayam kulaachalaspardhi kuchala manmadhyaamKumkuma vilipta gaatreem kurukullam manasi manmahesatatam\n\nWorshipping Her with Kumkuma, with complete love and faith is the quickest way to secure Her grace."
}