{
  "number": 534,
  "name_devanagari": "याकिन्यम्बास्वरूपिणी",
  "name_transliterated": "Yākinyambā-svarūpiṇī",
  "meaning": "At the Sahasrara Chakra She is Yākini Devi also known as Yaśasvinī (refer nama 474).",
  "commentary": "With this the initiation into all the Chakras is complete and Lalita Sahasranama now deals with the aspect of ‘yagna’. All yoga and karma (actions) culminate in yagna. Every action (karma) performed with an attitude of surrender (to the supreme force) is yagna. In other words, every deed should be undertaken with the feeling that it is being conducted on behalf of the Supreme Parabrahma and the karma should be offered completely to Him. As explained in Bhagavad Gita, Yagna is of varied types. Homa is a part of yagna. Even earnings in life are a part and parcel of this yagna and hence should be fairly distributed among the society. The balance that is left thereafter should be utilized for personal consumption. When this is practiced, yagna is being performed effectively.\n\nVisualization and contemplation of Chakras is a pure internal process. It is an inner sacrifice/ ritual (antar yaaga) and hence is classified as yagna. In this yagna, the prana (life energy) is offered as an ahuti to the Supreme Mother who resides within the Mooladhāra chakra.\n\nInner sacrifice (antar yaaga) is innumerable times superior to external sacrifices/ rituals (bahir yaaga). After the completion of the external worship, every person should sit in silent contemplation for at least a few minutes. He should churn his mind and try to figure out whether or not he is on the right path. ‘Have I progressed in my sadhana? Am I anywhere closer to reaching God or am I satisfied with the meager returns that I am achieving now? What is the true benefit of this sadhana?’ Answers to such questions pave the way for antar yaga. Mere understanding about this inner sacrifice bestows as much merit (punya) as actual performance of the yagna could grant. The most important names of such a yagna are now being taught in Lalita Sahasranama."
}