{
  "number": 535,
  "name_devanagari": "स्वाहा",
  "name_transliterated": "Svāhā",
  "meaning": "The Divine Mother manifests as Swāhā Devi to deliver the oblations of the yagna (āhuti) to the respective deity.",
  "commentary": "‘Swāhā’ is the mantra through which the homa oblations (ahuti) are delivered to the respective deity. Swāhā consists of 2 words su+aha. ‘Su’ means ‘good or auspicious’. Swaha thus means ‘auspiciously said’.\n\nJust as a letter posted without an address cannot reach the recipient, the oblations put in the homa fire without the utterance of the word ‘Swāhā’ never reach the proper deity to whom it was intended. The utterance of the word ‘Swahaa’ is followed by the deity’s name and the phrase- ‘idan na mama’. For example, an offering to Lord Indra is made together with the recitation of the phrase ‘Swāhā Indrayai idan na mama’. ‘Idan na mama’ means ‘the item being offered does not belong to ‘me’ (the person offering it). Here the person who is making the offering should consider himself as a tool in the offering process and the right attitude to entertain is ‘I am offering back to the Lord what genuinely belongs to Him.’\n\nDevi Bhagawatam explains the story of the manifestation of Goddess Swaha.\n\nOnce upon a time the increase in the number of demons caused a decline in the yagnas. Yagna is the only medium through which the hunger of the Devatas can be appeased. Troubled by hunger, the Devatas approached Lord Vishnu and sought refuge in Him. Lord Vishnu directed them to worship and appease the Supreme Mother, who would then find a solution to their distress. The Devatas undertook antar yaaga and looked for Her in the chidaakaasha.\n\nPleased with their worship the Supreme Mother appeared before them in the form of Swāhā Devi. Agni Deva (Fire God) wanted to accept her as his wife as only the combination of the homa fire and the utterance of the word ‘Swāhā’ the oblations offered in the yagna could reach the Devatas. However Swāhā Devi intended to marry Lord Vishnu himself. Towards this she undertook intense penance. Lord Vishnu appeared before her and promised that he would marry her in another manvathara (period of time). In this manvanthara He ordered her to marry the Fire God (Agni) and be a medium through which the offerings of the yagna could be carried to the Devatas. Hearing this, Swāhā Devi created from herself another form and with this new form appeared before Fire God and married him.The three-homa fires (tretagnis) i.e. Garhapatyagni, Dakshinagni and Ahavanagni are the sons of Swāhā and Lord Agni. Yagna is performed with the aid of Tretagnis. Goddess Swāhā also takes on many names, a few of them being Vahnipriya, Vahnijāya, Santoshakārini, Swāhā Devi, Shaktikriya, Kāladātri, Paripātakari, Dhruvā, Dahanashakti, Gati, Dāyikā, Samsārasāra roopa, Ghorasamsāra tārini, Devajeevanaroopa and Devaposhanakārini. Devi Bhāgavatam states that listening to these 16 names grants the good results of actual performance of yagna."
}