{
  "number": 611,
  "name_devanagari": "कलात्मिका",
  "name_transliterated": "Kalātmikā",
  "meaning": "Commentary:",
  "commentary": "a) She is the atma (soul, inner being) for all the 16 phases of moon (kalās) and is the support for all of them. Alternatively, it can be understood that these phases (kalās) are the soul (atma) of the Divine Mother.\n\nb) She is the atma (inner being) of the individual as he passes through all his 16 phases (kala).Each being goes through 4 stages of existence (phases) Viz., waking (jaagrat), dream (swapna), deep sleep (shushupti) and tureeya (the fourth or the transdantal stage). Within each of these 4 phases, the being has to pass through 4 sub-phases totaling 16 phases. Let us briefly understand the sub-phases that occur in each of these 4 phases.\n\nJaagrat avastha (waking state)- The 4 sub-phases that the being passes through during this waking state are Utpatti (awakening state), Jāgrati (fully awake, alert state), बोधा (bodhā) (learning state) and मनोव्या (manovyā) (anguish state). Awakening of the mind after a deep sleep and the commencement of thoughts and feelings in the mind is ‘utpatti’. When the mind is fully awake and is able to perceive the world and draw impressions, it is said to be in ‘jāgrati’ state. During this state of Jāgrati, the mind is able to learn and it passes through the ‘बोधाऽ (‘bodhā’) (learning) state. In addition, at this awakened state, the mind experiences varied feelings and emotions and goes through anguish. This is the ‘मनोव्याऽ (‘manovyā’) phase.\n\nSwapnaa avastha (dream state)- The four sub phases of this dream state are abhilāsha (desire), bhrama (hallucination), chinta (worry, anxiety) and vishaya smriti. The being goes to bed with a desire (abhilāsha) to fall asleep. During sleep he passes through the phase of bhrama (hallucination) when he is unsure whether the dream he is witnessing is real or not. The impressions taken in by the senses during the waking state now come back to him as his dreams. A certain degree of anxiety and thoughts (chinta) continue to exist. Vishaya smriti means recollection/reminiscence of the objects seen during the wakeful state.\n\nShushupti avastha (deep sleep state)- In this the four sub phases are marana, vismriti, moorcha and tamoguna pradhana nidra. ‘Marana’ refers to forgetfulness. Even the dreams fade and the person drifts into a deep sleep wherein he forgets his existence of the self (I) and this is ‘vismriti’. He merges into the infinite and this phase is ‘moorcha’. Now the being gets absorbed into a total deep sleep where there is no separate existence. This is called ‘tamoguna pradhana nidra’.\n\nWhile the above-mentioned 12 phases are automatically experienced by every being, this 4th stage of tureeya is can be experienced only by the accomplished yogis.\n\nTureeya – Its  sub phases are- ‘Vairagya’ (detachment), ‘mumukhutvam’ (intense longing for liberation), ‘Samadhi’ (deep intense contemplation), ‘nirmala manas’ (pure mind) and sadasad vivekam (discrimination between real and unreal).\n\nVedas state that 360 phases (kalas) emerge from the Devi’s feet. Thus each day of the year consists primarily of one phase.\n\nThe Divine Mother as a composite form that resides in all the phases is truly Kalātmika."
}