{
  "number": 725,
  "name_devanagari": "दक्षिणामूर्तिरूपिणी",
  "name_transliterated": "Dakṣiṇāmūrti-rūpiṇī",
  "meaning": "She has manifested as Lord Dakshināmūrty to bestow knowledge (jnana).",
  "commentary": "Dakshināmūrty is the Guru of all Gurus. In this form He dispels ignorance and grants knowledge (Jnana).\n\nDakshināmūrty stotram states –\n\nMouna Vyakhya prakatitha, para, Brahma thathwam yuvanam,Varshishtha anthevasad rishiganai, Ravrutham brahma nishtai,\n\nMaharishis Sanaka, Sananda and others, who are great jnanis (highly knowledgeable), experienced some discontent (lack of peace) as they were unable to grasp the highest tattva. In order to understand this, they approached Brahma. Lord Brahma however was engrossed in reciting the Vedas while Saraswati Devi was occupied with nadopaasana through her Veena. Here Lord Brahma was preaching the supreme essence through the medium of Nada (Vedas and Veena).\n\nNot impressed by this, they reached the abode of Lord Vishnu who was being dutifully served by his spouse, Goddess Lakshmi. Here Vishnu was imparting the divine essence through ‘Seva’ as a medium. Being eminent jnanis who had scaled greater heights than nada and seva, these Maharishis were unimpressed.\n\nThey now proceeded to the abode of Lord Shiva, who was imparting the same essence through the medium of the tandava dance (dance of bliss). This too had no effect on these saints. As they were about to depart, Lord Shiva threw aside ignorance and illusion from his right side and sat under a tree in absolute silence (mouna). It was the Divine Mother who appeared in this form. His smile was enchanting and his face serene. Silence was his mode of preaching. This mouna (silence) of Lord Dakshināmūrty gave them immense peace. It was then that they realized that true peace resides within. Silencing the mind and allowing it to remain stable is the key to bliss.\n\nThe Lord faces south and hence has taken on the name Dakshināmurty. He imparts knowledge (Jnana). He dispels all ignorance and doubts."
}