{
  "number": 749,
  "name_devanagari": "मृत्युदारुकुठारिका",
  "name_transliterated": "Mṛtyu-dāru-kuṭhārikā",
  "meaning": "She is the huge axe that chops the tree called death.",
  "commentary": "Mrtyu here refers to the ‘fear of death’ within the person. With Her grace, She dispels such fear in her devotees. Also, She relieves her devotee from the cycle of births and deaths (samsara).\n\nMrtyu means forgetfulness. Forgetting God and Sadguru is mrtyu.\n\nNames 742 (भव-धाव-सुधा-वृष्टिः) ((Bhava-dhāva-sudhā-vṛṣṭiḥ)) to 749 (मृत्यु-दारु-कुठारिका) ((Mṛtyu-dāru-kuṭhārikā)) detail the results of performing Nandi-vidya upasana. All these names above subtly referred to Her as a form of the five basic elements (pancha bhootas). With this name, the Nandi-vidya concludes.\n\nFrom the 750th name (Māheshwarī) up to the 790th name (Parāparā) teaches the Mangala-chandi-vidya; the knowledge about the Supreme Mother Mangala-chandi.\n\nShe is known by this name for the following reasons-\n\n– An emperor by name Mangala who belonged to Manu’ lineage worshipped Her and due to this She was addressed as Mangala-chandi.\n\n– Chandi is that aspect of Divine Mother who dispels the inauspiciousness and bestows auspiciousness. Hence She is Mangala-chandi (mangala means auspiciousness).\n\n– At the time of the destruction of Demon Tripuraasura, Lord Shiva worshipped Her as Chandi. The Devatas, who witnessed this worship, could see His auspicious form (mangala swaroopa) and hence this Devi was called Mangala-chandi.\n\n– Subrahmanya, who is also known as Mangala-graha (Planet Mars), worshipped Her and hence She is Mangala-chandi.\n\nDevi Bhagavatam contains this hymn (stotram) on Mangala-chandika –\n\nRaksha raksha jaganmāta devi Mangala-chandikeHarike vipadam rashe harsha-mangala-kārikeHarsha mangala dakshe ca harsha mangala dāyikeShubhe mangala dakshe ca shubhe mangala-chandikeMangala mangalarhe ca sarva mangala mangaleSatam mangalade devi sarvesham mangalalayePujya mangala-vāre ca mangalabhishta deivatheyPoojya mangala bhupasya manuvamshasya santatamMangaladhishthatru devi mangalanam ca mangaleSamsara mangaladhare moksha mangala dāyiniSare ca mangaladhare pare ca sarvakarmanam"
}