{
  "number": 785,
  "name_devanagari": "मार्ताण्डभैरवाराध्या",
  "name_transliterated": "Mārtāṇḍa-bhairavārādhyā",
  "meaning": "Commentary:",
  "commentary": "She is known by this name for two reasons-\n\nअ) लोर्द् स्हिव इन् हिस् फ़ोर्म् ओफ़् मार्ताण्ड-भैरव wओर्स्हिप्स् हेर्। (a) Lord Shiva in His form of Mārtāṇḍa-bhairava worships Her.)\n\nThere lived a demon by name Malla-daitya. To destroy him, Lord Shiva took on the form of Mallareeshwara or मार्ताण्ड-भैरव। (Mārtāṇḍa-bhairava.) He worshipped the divine Mother and sought Her blessings before setting out to kill the demon. As She was worshipped by Lord मार्ताण्ड-भैरव, (Mārtāṇḍa-bhairava,) She is मार्ताण्ड-भैरवाराध्या। (Mārtāṇḍa-bhairavārādhyā.)\n\nb) She is worshipped by Lord Sun who also takes on the name of मार्ताण्ड-भैरव। (Mārtāṇḍa-bhairava.)\n\nWhat would happen to the entire population of living beings if the Sun were to stop rising for just 3 days? He is our life-giver. He fills our collapsing body (mārta) with consciousness (chaitanya, anda) and rejuvenates us. Since He fills the beings with the life- consciousness He is Mārtanda. He dispels our fears about sickness and diseases and for this reason He is addressed as Bhairava. He is मार्ताण्ड-भैरव। (Mārtāṇḍa-bhairava.)\n\nTo dispel the darkness and to bless the world with the light, the Sun God prayed to the Divine Mother. Pleased with his prayers, the Divine Mother gave him a light-showering-glittering-gem called the Syamantaka mani out of thousands of such gems on Her crown. As She was worshipped by Lord Sun, She is मार्ताण्ड-भैरवाराध्या। (Mārtāṇḍa-bhairavārādhyā.)\n\nIt is a well-known fact that Bhairava is another name of Shiva. By adopting this name, the Lord Sun shows us his indistinguishable (abheda) nature from Lord Shiva. It is Lord Shiva who is appearing before us as the Sun God. During Rudra homa, the mantra ‘adityātmakayai rudrayai idan na mama’ is recited which means- Adithya (Sun God) and Rudra (Shiva) are one and the same.\n\nWorshipping the Lord Sun daily bestows the person with good health. Maharishi Agastya declares this in Adithya hrudayam stotram."
}