{
  "number": 919,
  "name_devanagari": "चैतन्यकुसुमप्रिया",
  "name_transliterated": "Caitanya-kusuma-priyā",
  "meaning": "Commentary:",
  "commentary": "She loves the offering of the flower called Chaitanya (Jnana).\n\nThe eight most important flowers that are to be offered to the Lord are-\n\nAhimsa prathamam pushpam pushpams-indriya-nigrahahKshanti-pushpam daya-pushpam Jnana-pushpam param matamTapah-pushpam satya-pushpam bhAva-pushpam athAsthamam.\n\na) Ahimsa (non-injury)- This is the first flower that is to be offered. Begin by checking and dusting off any insects that exist within the flowers/ other offerings that have been arranged for worship. When putting the firewood (samidha) into the fire pit (homa kunda), it should be dusted thoroughly so that any worms within it are not put into the homa fire. Non- injury to other living beings is a very important flower that is to be offered to the Lord. No other being should be mentally or physically hurt by one’s actions or words. Even troubling others or asking them to adjust because of our own puja routine or sadhanas is classified as injury (himsa).\n\nb) Controlling the senses (indriya nigraha)- This is the second flower offered. Even the mind is a sense organ. Controlling the mind results in controlling all other senses.\n\nc)\t Kshanti (forgiveness, kshama) – This is the third flower that should be offered to Her. In forgiveness one should learn from Mother Earth and should aim to be at par with her- kshamaya prithivee samaha.\n\nd)\t Daya (compassion) is the fourth flower. Everyone should develop compassion towards other beings.\n\ne)\t Jnana pushpam is the flower of knowledge. Knowledge (Jnana) comes from worship. Even the realization -‘after all I am but a little atom in this creation’ is knowledge and it should be reverentially offered to Her.\n\nf)\t Tapah pushpam- offering the penance (tapa, mantra) to Her is tapah pushpam. After completion of the day’s worship, the mantra into which the person has been initiated should be meditated upon for some time. This is the real Mantra- pushpam.\n\ng)\t  Satya pushpam- undertaking the vow of speaking only truth is satya pushpam. This flower is most dear to Her. Each time a person speaks the truth, he/ she is offering the satya pushpam to the Divine Mother. Likewise each time the person speaks untruth he/ she is causing pain to the Divine Mother and it amounts to taking back the flower that was offered earlier.\n\nh)\t Purity of feelings (bhava shuddi) is the eighth and the most important flower that is to be offered to the Divine Mother. All our actions should be done with feelings of absolute purity.\n\nThe one who is truly offers these eight flowers to the Supreme Mother can be said to be offering Chaitanya-kusuma (flowers of enlightenment) to Her. This is true Chaitanya archana."
}