{
  "number": 957,
  "name_devanagari": "धन्या",
  "name_transliterated": "Dhanyā",
  "meaning": "She takes even ordinary beings to that state of being dhanya. She manifests in the form of holy-beings (sat-purushas).",
  "commentary": "Those who contemplate about the topics discussed in the Upanishads, about liberation and about Vedanta and Brahmasutras are great persons and are called ‘dhanya’. Those who are serious about subduing the five senses (pancha indriyas) are addressed as dhanya. Those who have compassion towards all living beings (sarva bhuta daya) are dhanya. All these are elevated souls.\n\n‘Who is a satpurusha’? Once Maharishi Narada expressed this doubt to Lord Mahavishnu. In response, Lord Vishnu asked Narada to go to earth and visit the piglet that had just been delivered. This was the most unusual reply, but Maharishi, who couldn’t go against the orders of His Lord, visited the piglet. The piglet looked at the saint and in a couple of minutes breathed its last. Narada returned to Vaikuntha in deep sorrow. However the Lord asked him to now proceed and visit the bird that had just been born on earth. This little bird too died as soon as Maharishi Narada paid it a visit. Shocked at this turn of events, the Maharishi returned to Vaikuntha in distress. Instead of replying to the original question, Lord Vishnu now directed him to visit the calf that had just been born. Afraid of Go-hatya (sin of killing a cow) and yet unable to go against the word of the Lord, Narada slowly but hesitatingly, reached the home of the cow. The calf that was a few minutes old, died as soon as it saw Maharishi Narada. Now Narada decided that it was better to stay at the gate of Vaikuntha. He was afraid of where the Lord would direct him to go.\n\nJust as he feared, the Lord called him in and asked him to visit a newborn prince on earth. Narada replied that he was an unlucky being and that just his sight the newborn animals were dying. With his visit he was sure of the impending death of the prince. But yet the Lord was unmoved and stood by his directive. Narada hesitantly made his way to the palace. The king received him with due honour and asked him to bless his newborn son. Narada cast a  quick and brief glanc at the baby. The baby in turn smiled and spoke in a subtle tone that was audible only to the Maharishi – ‘Maharishi Narada! That day in Vaikuntha you sought the answer to your question- who is a satpurusha? Now listen to my answer. You are truly a holy person (satpurusha). That day, it was I who was born as a piglet. Just by your darshan, my life as a piglet ended and I was blessed to be reborn as a bird. You paid me a visit and by your grace, I ended that life and was born as a calf. You were graceful enough to bless me with your darshan. My life as a calf came to an end and here, now I am, by your grace, born a prince. I have moved from animal to human birth. All this is the result of you endless repetition of Narayana japam’. With this enlightenment, Narada began composing the bhakti sutras."
}